package vo;

public class Filtering {
	private String[] filter = { "씨발", "개새끼", "존나", "ㅈㄴ", "ㅅㅂ",
			"개같이", "개걸래", "개걸레", "개고치", "개너미", "개라슥", "개마이", "개보지",
			"개부달", "개부랄", "개불랄", "개붕알", "개새기", "개새끼", "개색뀌", "개색휘", "개샛기", "개소리", "개쉐뀌", "개씁년", "개씁블", "개씨발", "개씨블",
			"개아기", "개자식", "개자지", "개잡년", "개저씨", "개저엇", "개지랄", "개후라", "걔잡년", "거시기", "걸래년", "걸레년", "게가튼", "게부럴", "게저엇",
			"계새끼", "괘새끼", "괴가튼", "굿보지", "김대중", "김치녀", "깨쌔끼", "나빼썅", "내미랄", "내미럴", "내버지", "내씨발", "내자지", "내잠지", "내조지",
			"노네들", "노알라", "노무현", "느그매", "니기미", "니미기", "니미랄", "니미럴", "니아범", "니애미", "니애비", "닝기리", "닥쳐라", "닥치세", "달달이",
			"달딸이", "닳은년", "대가리", "대음순", "더엉신", "돈새끼", "돌았네", "돌으년", "뒤져라", "뒤져버", "뒤져야", "뒤져요", "뒤지겠", "뒤지길", "뒤진다",
			"뒤치기", "뒷치기", "드응신", "디져라", "디지고", "따먹기", "따먹어", "따먹자", "딸달이", "딸딸이", "떠라이", "또라이", "또라인", "똘아이", "띠발뇬",
			"띠부울", "띠브울", "띠블넘", "띠이발", "띠이벌", "막간년", "맛간년", "미쳣네", "미쳤나", "미쳤니", "미치인", "미친ㅋ", "미친개", "미친넘", "미친년",
			"미친놈", "미친눔", "미친새", "미친색", "미티넘", "미틴것", "방점뱅", "백보지", "버어지", "버지털", "버짓물", "보지녀", "보지물", "보지털", "보짓물",
			"뷰웅신", "빠가냐", "빠간가", "빠가새", "빠가니", "빠구리", "빠구울", "빠굴이", "빠아가", "빡새끼", "빨치산", "사까쉬", "사까시", "사새끼", "새ㄲㅣ",
			"새끼라", "새끼야", "성교해", "성폭행", "세엑스", "세엑쓰", "섹스해", "소음순", "쉬방새", "쉬이바", "쉬이이", "쉽알넘", "슈ㅣ발", "슈우벌", "슨상님",
			"시댕이", "시바류", "시바알", "시바앙", "시발년", "시발놈", "시방새", "시벌탱", "시볼탱", "시부럴", "시부렬", "시부울", "시뷰럴", "시뷰렬", "시이발",
			"시입세", "시키가", "시팔넘", "시팔년", "시팔놈", "십버지", "십부랄", "십부럴", "십세리", "십세이", "십셰리", "십쉐끼", "십자석", "십자슥", "십지랄",
			"십창녀", "십팔넘", "싸가지", "싸물어", "쌍보지", "쌔엑스", "쎄엑스", "씨ㅂㅏ", "씨댕이", "씨바라", "씨바알", "씨발년", "씨발롬", "씨방새", "씨방세",
			"씨버럼", "씨벌년", "씨벌탱", "씨볼탱", "씨부랄", "씨부럴", "씨부렬", "씨불알", "씨뷰럴", "씨뷰렬", "씨브럴", "씨블년", "씨빠빠", "씨섹끼", "씨이발",
			"씨입새", "씨입세", "씨파넘", "씨팍넘", "씨퐁넘", "씨퐁뇬", "씹미랄", "씹버지", "씹보지", "씹부랄", "씹브랄", "씹빵구", "씹뻐럴", "씹뽀지", "씹새끼",
			"씹쉐뀌", "씹쌔끼", "씹자석", "씹자슥", "씹자지", "씹지랄", "씹창녀", "씹탱이", "씹팔넘", "아가리", "애미랄", "애애무", "애에무", "애에미", "애에비",
			"에애무", "에에무", "에에미", "에에비", "여어엄", "여엄병", "염병할", "엿이나", "왕버지", "왕자지", "왕잠지", "왜저럼", "유우깝", "유우방", "은새끼",
			"이새끼", "자압것", "자지털", "잠지털", "젓같내", "젓냄새", "젓만이", "정액짜", "젖탱이", "졌같은", "조가튼", "조오또", "조오웃", "조오지", "조온나",
			"조온니", "조온만", "조올라", "조옷만", "족같내", "족까내", "존.나", "존ㄴ나", "존나아", "존마니", "좀마니", "좃간년", "좃까리", "좃깟네", "좃냄새",
			"좃만아", "좃만이", "좃보지", "좃부랄", "좃빠네", "좆까라", "좆만아", "좆먹어", "좆빨아", "좆새끼", "좋오웃", "죠온나", "주글년", "주길년", "주둥이",
			"줬같은", "지껄이", "ㅈ1랄", "지이랄", "쪽바리", "찝째끼", "쳐받는", "쳐발라", "친구년", "친노마", "큰보지", "페니스", "허벌년", "허벌레", "허어벌",
			"호냥년", "호로자", "호로잡", "화낭년", "화냥년", "후.려", "후라덜", "후우장", "미칭럼", "느금마", "ㅈ같네", "ㅁㅊ", "ㅁ친", "ㅂㄹ", "ㅂㅊ", "ㅂ크",
			"ㅅㅂ", "ㅅㅍ", "ㅅㅋ", "ㅅ루", "ㅅ발", "ㅆㄺ", "ㅆㅂ", "ㅆㅣ", "ㅈㄴ", "ㅈㄹ", "ㅈ리", "강간", "개간", "개같", "개넷", "개년", "개놈", "개독",
			"개련", "개섹", "개셈", "개젓", "개좆", "개쩌", "게젓", "골빈", "공알", "구씹", "귀두", "꼭지", "년놈", "뇌텅", "뇨온", "늬믜", "늬미", "니년",
			"니믜", "니미", "닥쳐", "대갈", "돈년", "뒈져", "뒤졌", "뒤질", "등신", "디졌", "디질", "딴년", "띠바", "띠발", "띠벌", "띠벨", "띠불", "띠블",
			"런년", "럼들", "롬들", "맘충", "머갈", "믜칀", "믜친", "미띤", "미췬", "미칀", "미친", "미틴", "및힌", "발놈", "벌창", "벵신", "별창", "병닥",
			"병딱", "병맛", "병신", "병크", "보지", "봉알", "부랄", "불알", "붕신", "붕알", "븅신", "브랄", "빙띤", "빙신", "빠굴", "빠네", "빠라", "빠큐",
			"빻았", "빻은", "뻐규", "뻐큐", "뻑유", "뻑큐", "뻨큐", "뼈큐", "뽀지", "상년", "새끼", "새퀴", "새킈", "새키", "색희", "색히", "샊기", "샊히",
			"샹년", "섀키", "성괴", "성교", "세끼", "세키", "섹끼", "섹스", "쇅끼", "쇡끼", "쉐끼", "쉬박", "쉬발", "쉬버", "쉬빡", "쉬탱", "쉬팍", "쉬펄",
			"쉽세", "슈발", "슈벌", "스벌", "싑창", "시바", "시파", "시발", "시벌", "시빡", "시빨", "시탱", "시팍", "시팔", "시펄", "십녀", "십새", "십세",
			"십창", "십탱", "십팔", "싹스", "쌍년", "쌍놈", "쌔끼", "쌕스", "쌕쓰", "썅놈", "썅년", "썌끼", "쎄끼", "쎄리", "쎅스", "쎅쓰", "쒸8", "쒸댕",
			"쒸발", "쒸팔", "쒸펄", "쓰댕", "쓰뎅", "쓰렉", "쓰루", "쓰바", "쓰발", "쓰벌", "쓰벨", "쓰파", "씌8", "씌댕", "씌뎅", "씌발", "씌벨", "씌팔",
			"씝창", "씨8", "씨걸", "씨댕", "씨뎅", "씨바", "씨발", "씨벌", "씨벨", "씨블", "씨븡", "씨비", "씨빡", "씨빨", "씨뻘", "씨입", "씨팍", "씨팔",
			"씨퐁", "씹귀", "씹년", "씹덕", "씹못", "씹물", "씹새", "씹세", "씹쌔", "씹창", "씹치", "씹탱", "씹팔", "씹할", "아닥", "애무", "애미", "애비",
			"앰창", "야동", "엄창", "에무", "에미", "에비", "엠생", "엠창", "염병", "염뵹", "엿같", "옘병", "외퀴", "요년", "유깝", "유두", "유방", "육갑",
			"은년", "음경", "이년", "자위", "자지", "잠지", "짬지", "잡것", "잡년", "잡놈", "저년", "저엇", "저엊", "적까", "절라", "점물", "젓까", "젓떠",
			"젓물", "젓밥", "젖같", "젖까", "젗같", "젼나", "젼낰", "졏같", "조깟", "조또", "조온", "족까", "존귀", "존귘", "존나", "존낙", "존내", "존니",
			"존똑", "존맛", "존멋", "존버", "존싫", "존쎄", "존쎼", "존예", "존웃", "존잘", "존잼", "존좋", "존트", "졸귀", "졸귘", "졸라", "졸맛", "졸멋",
			"졸싫", "졸예", "졸웃", "졸잼", "졸좋", "좀물", "좁밥", "좃까", "좃넘", "좃도", "좃또", "좃물", "좃털", "종나", "좆까", "좆나", "좆년", "좆도",
			"좆물", "좆밥", "좆털", "좋만", "죠낸", "죤나", "죤내", "죵나", "쥐랄", "쥰나", "쥰내", "쥰니", "쥰트", "즤랄", "지랄", "지럴", "지롤", "지뢀",
			"지뢰", "짱깨", "짱께", "쪼녜", "쪼다", "쪽발", "쫓같", "쬰잘", "창남", "창녀", "창년", "창놈", "처먹", "첫빠", "쳐마", "쳐먹", "취ㅈ", "취좃",
			"친년", "친놈", "파친", "펑글", "항문", "허벌", "호로", "후려", "후장", "꽃휴", "ㅂㅅ", "걔섀", "느금", "늑음", "ㅈ같", "ㅄ", "凸", "뇬",
			"썅", "씹", "좃", "좆" };

	public String[] getFilter() {
		return filter;
	}

	public void setFilter(String[] filter) {
		this.filter = filter;
	}

}
